app/views/articles/show.html.erb

<hr>
<% if @article.pictures.present? %>
<div class="galleria">
<% @article.pictures.each do |art| %>
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."article_id" = ?  [["article_id", 1]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."article_id" = ?  [["article_id", 3]]