app/controllers/admin_controller.rb

    def index
        @users = User.all
        @articles = Article.all
---
SELECT "users".* FROM "users" LIMIT ?  [["LIMIT", 1]]
SELECT "articles".* FROM "articles"

     def destroy
        @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]