app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "post_owner") VALUES (?, ?, ?, ?, ?)  [["title", "costam"], ["text", "test1\r\n"], ["created_at", "2020-11-09 10:23:40.258088"], ["updated_at", "2020-11-09 10:23:40.258088"], ["post_owner", "cos@cos.com"]]
---
  def create
    @article = Article.new(article_params)
    authorize @article
    @article.post_owner = current_user.email
    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "post_file" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["post_file", "image.jpeg"], ["updated_at", "2020-11-02 11:44:47.604143"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])
    authorize @article
    if @article.update(article_params)

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 1]]
---
  def destroy
    @article = Article.find(params[:id])
    authorize @article
    @article.destroy