app/controllers/pictures_controller.rb

  def create
    @article = Article.find(params[:article_id])
    @picture = @article.pictures.create(picture_params)
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "pictures" ("article_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?)  [["article_id", 1], ["created_at", "2020-11-02 13:55:20.726201"], ["updated_at", "2020-11-02 13:55:20.726201"], ["picture", "image.jpeg"]]