app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "image" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "pklisek"], ["image", "image.jpeg"], ["updated_at", "2020-11-02 11:03:19.849753"], ["id", 2]]